package com.example.driveremote.api
object Constants {
    const val BASE_URL = "https://464a-149-50-102-72.ngrok-free.app"
    const val EmotionalExhaustion = "Эмоциональное истощение проявляется в снижении эмоционального тонуса, повышенной психической истощаемости и аффективной лабильности, равнодушием, неспособностью испытывать сильные эмоции, как положительные, так и отрицательные, утраты интереса и позитивных чувств к окружающим, ощущении «пресыщенности» работой, неудовлетворенностью жизнью в целом."
    const val Depersonalization = "Деперсонализация проявляется в эмоциональном отстранении и безразличии, формальном выполнении профессиональных обязанностей без личностной включенности и сопереживания, а в отдельных случаях – в раздражительности, негативизме и циничном отношении к коллегам и пациентам. На поведенческом уровне «деперсонализация» проявляется в высокомерном поведении, использовании профессионального сленга, юмора, ярлыков."
    const val PersonalAchievement = "Редукция профессиональных достижений проявляется в негативном оценивании себя, результатов своего труда и возможностей для профессионального развития. Высокое значение этого показателя отражает тенденцию к негативной оценке своей компетентности и продуктивности и, как следствие, снижение профессиональной мотивации, нарастание негативизма в отношении служебных обязанностей, в лимитировании своей вовлеченности в профессию за счет перекладывания обязанностей и ответственности на других людей, к изоляции от окружающих, отстраненность и неучастие, избегание работы сначала психологически, а затем физически."
    const val STATUS_NORMAL = "#388E3C"
    const val STATUS_WARNING = "#FFA000"
    const val STATUS_CRITICAL = "#D32F2F"
    const val RED_GRAPH = "#BFFF0000"
    const val GREEN_GRAPH = "#BF00FF00"
    const val BLUE_GRAPH = "#BF0000FF"
    const val DARK_GREEN = "#00B147"
    const val BLACK = "#000000"
    const val TIME_LIMIT = 24 * 60 * 60 * 1000
}